%
% Отрабатываем логику проверки субарендного договора
%
% Стандартные переменные:
% C - номер договора, строка
% S - номер этапа, целое число
% D - дата в формате Prolog Date(YYYY, MM, DD)
% Now - дата, на которую выполняем проверку 

% Путь к нашим библиотекам
library_directory('.').

% Загрузим библиотеки
:- use_module(library(date_lib)).

% Кодировка UTF-8 для работы с предикатами на русском языке
% Для коррекной работы с русским языком нужно сохранять файлы в кодировке UTF-8 BOM
encoding(utf8).

% Сервисные функции работы с датами
дата_договора(_).
дата_договора(YMD, D) :- date_from_text(YMD, D).

% Определение договора
договор('01-18/САР').
договор(НомерДоговора1, НомерДоговора2) :- НомерДоговора2 = НомерДоговора1.

% Определение договора: договор_субаренды(?КодДоговора, ?Дата)
договор_субаренды('01-18/САР', дата_договора('2018-02-01')).

% Определение Арендодателя: арендодатель(+НомерДоговора, +Юрлицо)
арендодатель('ООО "ААА"').
% Определение Арендатора: арендодатель(+НомерДоговора, +Юрлицо)
арендатор('ООО "БББ"').

% Определение подписантов для юрлиц: подписант(+Юрлицо, +ФИО, +Должность)
подписант('ООО "ААА"', 'Орлов Дмитрий Алексеевич', 'Заместитель генерального директора').
подписант('ООО "БББ"', 'Иванов Виктор Кириллович', 'Генеральный директор').

% Определение объекта аренды: объект_аренды(договор, помещение, площадь м2, адрес)
объект_аренды('01-18/САР', 'Офис 1', 300, 'г. Москва, ул. Тверская д.1').
объект_аренды('01-18/САР', 'Склад 1', 300, 'г. Москва, ул. Тверская д.1').

объект_аренды('01-18/САР', 'Офис 2', 300, 'г. Москва, Ленинский проспект д.2').
объект_аренды('01-18/САР', 'Склад 2', 300, 'г. Москва, Ленинский проспект д.2').

% Для проверки в SublimeText
main.
