%
% Отрабатываем логику проверки субарендного договора
%
% Стандартные переменные:
% C - номер договора, строка
% S - номер этапа, целое число
% D - дата в формате Prolog Date(YYYY, MM, DD)
% Now - дата, на которую выполняем проверку 

% Путь к нашим библиотекам
library_directory('.').

% Загрузим библиотеки
:- use_module(library(date_lib)).

% Кодировка UTF-8 для работы с предикатами на русском языке
% Для коррекной работы с русским языком нужно сохранять файлы в кодировке UTF-8 BOM
encoding(utf8).

% Сервисные функции работы с датами; формат даты YYYY-MM-DD (например, 2017-12-29)
дата(_).
дата_договора(D) :- дата(D).
дата(YMD, D) :- date_from_text(YMD, D).

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% База знаний для договора субаренды
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Определение типа договора: тип_договора(+Тип)
тип_договора(аренда).
тип_договора(субаренда).

% Определение типа стороны договора
тип_стороны_договора(арендатор).
тип_стороны_договора(арендодатель).
тип_стороны_договора(заказчик).
тип_стороны_договора(исполнитель).

% Определение юридических лиц: юрлицо(+КодЮрлица, +НазваниеЮрлица, +Форма)
юрлицо('Масковия', 'Масковия', 'ООО').
юрлицо('ТоргТех', 'Торговые технологии', 'ООО').
юрлицо('(нет)', '(нет)', '(нет)').

% Определение сторон договора: сторона_договора(+НомерДоговора, +ТипСтороны, +КодЮрлица)
сторона_договора('01-18/САР', тип_стороны_договора(арендодатель),'Масковия').
% Определение Арендатора: арендодатель(+НомерДоговора, +КодЮрлица)
сторона_договора('01-18/САР', тип_стороны_договора(арендатор), 'ТоргТех').

% Определение договора: договор(+НомерДоговора, +ТипДоговора, +ДатаДоговора, +СторонаЗакзачик, +СторонаИсполнитель)
договор('01-18/САР', тип_договора(субаренда), дата_договора('2018-02-01'),
	сторона_договора('01-18/САР', тип_стороны_договора(арендатор), 'ТоргТех'),
	сторона_договора('01-18/САР', тип_стороны_договора(арендодатель),'Масковия')).

% Договор аренды - основание для субаренды
договор('01-02/АР', тип_договора(аренда), дата_договора('2017-03-31'),
	сторона_договора('01-02/АР', тип_стороны_договора(арендатор), 'ТоргТех'),
	сторона_договора('01-02/АР', тип_стороны_договора(арендодатель), '(нет)')).

% Определение основания для подписания договора: устав(+КодЮрлица) или доверенность(+КодЮрлица, +НомерДоверенности, +ДатаДоверенности)
устав('ТоргТех').
доверенность('Масковия', '511', '2017-12-29').

% Определение подписантов для юрлиц: подписант(+Юрлицо, +ФИО, +Должность, +Основание(+Устав/+Доверенность(...))
подписант('Масковия', 'Орлов Дмитрий Алексеевич', 'Заместитель генерального директора', доверенность('Масковия', '511', '2017-12-29')).
подписант('ТоргТех', 'Иванов Виктор Кириллович', 'Генеральный директор', устав('ТоргТех')).

% Условия использования объекта аренды
офис.
склад.
транспортные_услуги.
тоговля.
иные_виды_деятельности.

% Определение объекта аренды: объект_аренды(+КодДоговора, ID_ОбъектаАренды, +Наименование, +Площадь м2, +Адрес, [+ВидыДеятельности])
объект_аренды('01-18/САР', 1, 'Помещение №1', 250, '115487, город Москва, 2-й Нагатинский проезд, дом 2, строение 1', [офис, склад, транспортные_услуги, троговля, иные_виды_деятельности]).
объект_аренды('01-18/САР', 2, 'Помещение №2', 1300, '115487, город Москва, 2-й Нагатинский проезд, дом 2, строение 2', [офис, склад, транспортные_услуги, троговля, иные_виды_деятельности]).

% Справочник: код валюты
валюта(usd).
валюта(rur).

% Условия оплаты по договору: арендная_плата(+КодДоговора, +Сумма, +Валюта, +НДС_включён, НДС_%, +ОплатаЧислоМесяца)
арендная_плата('01-18/САР', 320000, валюта(rur), true, 18, 5).

% Включение платежей в арендную плату: арендная_плата_платежи(+КодДоговора, +ЭкологичПлатежи, ПлатаЗемельныеУчастки, +ПлатыЗаКоммуникации, +КоммунальныеПлатежиВкл, +ПлатаЭлекрВкл, +ПлатаТелефонВкл)
арендная_плата_платежи('01-18/САР', true, true, true, false, false, false).

% Условия арендной платы: арендная_плата_первый_платёж(+КодДоговора, +СрокОплаты, +ЗаПервыйМесяц, +ЗаПоследнийМесяц)
арендная_плата_первый_платёж('01-18/САР', дата('2018-02-05'), true, true).

% Обработаем уведомления об изменении аоендной платы: уведомление_изменение_платы(+КодДоговора, ДатаУведомления, ДатаИзменения, +Сумма, +Валюта)
уведомление_изменение_платы('01-18/САР', дата('2018-06-11'), дата('2018-07-05'), 340000, валюта(rur)).
уведомление_изменение_платы('01-18/САР', дата('2018-12-15'), дата('2019-01-05'), 375000, валюта(rur)).

% Передаточный акт (о передаче помещени): передаточный_акт(+КодДоговора, +ДатаАкта, +СторонаСдала, +СторонаПриняла, [+ID_ОбъектаАренды])
передаточный_акт('01-18/САР', дата('2018-01-01'),
	сторона_договора('01-02/АР', тип_стороны_договора(арендатор), 'ТоргТех'),
	сторона_договора('01-18/САР', тип_стороны_договора(арендодатель),'Масковия'),
	[1, 2]).

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Служебные функции
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Задаём контест работы: код текущего договора
задать_текущий_договор(НомерДоговора) :-
	nb_setval('текущий_договор_номер', НомерДоговора).

% Получаем контекст работы: код текущего договора
текущий_договор(НомерДоговора) :-
	nb_getval('текущий_договор_номер', НомерДоговора).

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Стандартные запросы  к экспертной системе
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Получим сумму оплаты по договору на заданную дату: сумма_оплаты_на_дату(+КодДоговора,+Дата, -Сумма, -Валюта)
сумма_оплаты_на_дату(КодДоговора, Дата, Сумма, Валюта) :- 
	уведомление_изменение_платы(КодДоговора, _, ДатаИзменения, Сумма, Валюта),
	ДатаИзменения @>= Дата.

сумма_оплаты_на_дату(КодДоговора, Дата, Сумма, Валюта) :- 
	\+ уведомление_изменение_платы(КодДоговора, _, _, _, _),
	арендная_плата(КодДоговора, Сумма, Валюта, _, _, _),
	арендная_плата_первый_платёж(КодДоговора, СрокОплаты, _, _),
	Дата @>= СрокОплаты.

% Получить параметры текущего договора
атрибуты_договора(НомерДоговора, ТипДоговора, ДатаДоговора, Заказчик, Исполнитель) :-
	текущий_договор(НомерДоговора),
	договор(НомерДоговора, ТипДоговора, ДатаДоговора, Заказчик, Исполнитель).

% Данные об оплате в следующем месяце: НомерДоговора берётся из контекста
% TODO: использовать сумма_оплаты_на_дату() вместо арендная_плата()
атрибуты_следующей_оплаты(НомерДоговора, ДатаОплаты, СуммаОплаты, Валюта) :-
	текущий_договор(НомерДоговора),
	арендная_плата(НомерДоговора, СуммаОплаты, валюта(Валюта), _, _, ДеньОплаты),
	today(Сегодня),
	format_time(atom(Y), '%Y', Сегодня), atom_string(Y, YS), number_string(ГодОплаты, YS),
	format_time(atom(M), '%m', Сегодня), atom_string(M, MS), number_string(MN, MS),
	(MN =:= 12 -> (МесяцОплаты = 1, ГодОплаты is  ГодОплаты + 1); МесяцОплаты is MN + 1),
	atomics_to_string([ГодОплаты, '-', МесяцОплаты, '-', ДеньОплаты], Str), atom_string(ДатаОплаты, Str).

% Предикат main для проверки синтаксиса в SublimeText
main.
