%
% Отрабатываем логику проверки субарендного договора
%
% Стандартные переменные:
% C - номер договора, строка
% S - номер этапа, целое число
% D - дата в формате Prolog Date(YYYY, MM, DD)
% Now - дата, на которую выполняем проверку 

% Путь к нашим библиотекам
library_directory('.').

% Загрузим библиотеки
:- use_module(library(date_lib)).
%:-use_module(library(chr)).

% Кодировка UTF-8 для работы с предикатами на русском языке
% Для коррекной работы с русским языком нужно сохранять файлы в кодировке UTF-8 BOM
encoding(utf8).

%:-chr_type тип_договора ---> аренда; субаренда.
%:-chr_type тип_стороны_договора ---> арендатор; арендодатель; заказчик; исполнитель.

%:-chr_constraint тип_стороны_договора(-тип_стороны_договора).
%:-chr_constraint тип_договора(-тип_договора).

% Сервисные функции работы с датами; формат даты YYYY-MM-DD (например, 2017-12-29)
%дата(YYYY-MM-DD) :- date(YYYY, MM, DD),!.
дата(YYYY-MM-DD, Date) :- ymd2date(YYYY-MM-DD, Date).
дата(TXT, D) :- string(TXT), date_from_text(TXT, D),!.
вдату(Date, Дата) :- date2ymd(Date, Дата).

дата_договора(D) :- date(D).

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% База знаний для договора субаренды
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Определение типа договора: тип_договора(+Тип)
тип_договора(аренда).
тип_договора(субаренда).

% Определение типа стороны договора
тип_стороны_договора(арендатор).
тип_стороны_договора(арендодатель).
тип_стороны_договора(заказчик).
тип_стороны_договора(исполнитель).

% Определение юридических лиц: юрлицо(+КодЮрлица, +НазваниеЮрлица, +Форма)
юрлицо('Масковия', 'Масковия', 'ООО').
юрлицо('ТоргТех', 'Торговые технологии', 'ООО').
юрлицо('(нет)', '(нет)', '(нет)').

% Определение сторон договора: сторона_договора(+НомерДоговора, +ТипСтороны, +КодЮрлица)
сторона_договора('01-18/САР', тип_стороны_договора(арендодатель),'Масковия').
% Определение Арендатора: арендодатель(+НомерДоговора, +КодЮрлица)
сторона_договора('01-18/САР', тип_стороны_договора(арендатор), 'ТоргТех').

% Определение договора: договор(+НомерДоговора, +ТипДоговора, +ДатаДоговора, +СторонаЗакзачик, +СторонаИсполнитель)
договор('01-18/САР', тип_договора(субаренда), 2018-02-01,
	сторона_договора('01-18/САР', тип_стороны_договора(арендатор), 'ТоргТех'),
	сторона_договора('01-18/САР', тип_стороны_договора(арендодатель),'Масковия')).

% Договор аренды - основание для субаренды
договор('01-02/АР', тип_договора(аренда), 2017-03-31,
	сторона_договора('01-02/АР', тип_стороны_договора(арендатор), 'ТоргТех'),
	сторона_договора('01-02/АР', тип_стороны_договора(арендодатель), '(нет)')).

% Определение основания для подписания договора: устав(+КодЮрлица) или доверенность(+КодЮрлица, +НомерДоверенности, +ДатаДоверенности)
устав('ТоргТех').
доверенность('Масковия', '511', 2017-12-29).

% Определение подписантов для юрлиц: подписант(+Юрлицо, +ФИО, +Должность, +Основание(+Устав/+Доверенность(...))
подписант('Масковия', 'Орлов Дмитрий Алексеевич', 'Заместитель генерального директора', доверенность('Масковия', '511', 2017-12-29)).
подписант('ТоргТех', 'Иванов Виктор Кириллович', 'Генеральный директор', устав('ТоргТех')).

% Условия использования объекта аренды
офис.
склад.
транспортные_услуги.
тоговля.
иные_виды_деятельности.

% Определение объекта аренды: объект_аренды(+КодДоговора, ID_ОбъектаАренды, +Наименование, +Площадь м2, +Адрес, +[ВидыДеятельности])
объект_аренды('01-18/САР', 1, 'Помещение №1', 250, '115487, город Москва, 2-й Нагатинский проезд, дом 2, строение 1', [офис, склад, транспортные_услуги, троговля, иные_виды_деятельности]).
объект_аренды('01-18/САР', 2, 'Помещение №2', 1300, '115487, город Москва, 2-й Нагатинский проезд, дом 2, строение 2', [офис, склад, транспортные_услуги, троговля, иные_виды_деятельности]).

% Справочник: код валюты
валюта(usd).
валюта(rur).

код_валюты(валюта(usd), 'USD').
код_валюты(валюта(rur), 'рублей').

% Условия оплаты по договору: арендная_плата(+КодДоговора, +Сумма, +Валюта, +НДС_включён, НДС_%, +ОплатаЧислоМесяца)
арендная_плата('01-18/САР', 320000, валюта(rur), true, 18, 5).

% Включение платежей в арендную плату: арендная_плата_виды_платежей(КодДоговора, ЭкологичПлатежи, ПлатаЗемельныеУчастки, ПлатыЗаКоммуникации, КоммунальныеПлатежиВкл, ПлатаЭлекрВкл, ПлатаТелефонВкл)
арендная_плата_виды_платежей('01-18/САР', true, true, true, false, false, false).

% Условия арендной платы: арендная_плата_первый_платёж(+КодДоговора, +СрокОплаты, +ЗаПервыйМесяц, +ЗаПоследнийМесяц)
арендная_плата_первый_платёж('01-18/САР', 2018-02-05, true, true).

% Обработаем уведомления об изменении аоендной платы: уведомление_изменение_платы(+КодДоговора, ДатаУведомления, ДатаИзменения, +Сумма, +Валюта)
уведомление_изменение_платы('01-18/САР', 2018-06-11, 2018-07-05, 340000, валюта(rur)).
уведомление_изменение_платы('01-18/САР', 2018-10-01, 2018-10-05, 351000, валюта(rur)).
уведомление_изменение_платы('01-18/САР', 2018-12-25, 2019-01-05, 375000, валюта(rur)).

% Фальшивый предикат для компилятора
уведомление_изменение_платы('@@@@@', 2000-01-01, 2000-01-01, 0, валюта(rur)).


% Передаточный акт (о передаче помещени): передаточный_акт(+КодДоговора, +ДатаАкта, +СторонаСдала, +СторонаПриняла, [+ID_ОбъектаАренды])
передаточный_акт('01-18/САР', 2018-01-01,
	сторона_договора('01-02/АР', тип_стороны_договора(арендатор), 'ТоргТех'),
	сторона_договора('01-18/САР', тип_стороны_договора(арендодатель),'Масковия'),
	[1, 2]).

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Служебные функции
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Задаём контест работы: код текущего договора
задать_текущий_договор(НомерДоговора) :-
	nb_setval('текущий_договор_номер', НомерДоговора).

% Получаем контекст работы: код текущего договора
текущий_договор(НомерДоговора) :-
	nb_getval('текущий_договор_номер', НомерДоговора).

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Стандартные запросы  к экспертной системе
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Вспомогательный предикат Найти все уведомления об изенении платы с датой изменения меньше заданной: уведомление_изменение_платы_надату(+НомерДоговора, +НаДату, -ДатаИзменения, -Сумма, -Валюта)
уведомление_изменение_платы_надату(НомерДоговора, НаДату, ДатаИзменения, Сумма, Валюта) :-
	дата(НаДату, OnDate),
	уведомление_изменение_платы(НомерДоговора, _, ДатаИзменения, Сумма, Валюта), 
	дата(ДатаИзменения, ChDate), OnDate @>= ChDate.

% Получим сумму оплаты по договору на заданную дату когда есть уведомления на изменение платы на эту дату: сумма_оплаты_на_дату(+КодДоговора,+Дата, -Сумма, -Валюта)
сумма_оплаты_надату(НомерДоговора, НаДату, ДатаИзменения, Сумма, Валюта) :- 
	%write('сумма_оплаты_надату #1 '), writeln(НаДату),
	текущий_договор(НомерДоговора),
	уведомление_изменение_платы_надату(НомерДоговора, НаДату, _, _, _),!,
	дата(НаДату, OnDate),
	findall(D, (уведомление_изменение_платы(НомерДоговора, _, ДатаИзм, Сумма, Валюта), дата(ДатаИзм, D), D @=< OnDate), Lst),
	find_last_date(Lst, LastDate), вдату(LastDate, ДатаИзменения),
	уведомление_изменение_платы(НомерДоговора, _, ДатаИзменения, Сумма, Валюта).

% Получим сумму оплаты по договору на заданную дату когда нет уведомлений на изменение платы на эту дату: сумма_оплаты_на_дату(+КодДоговора,+Дата, -Сумма, -Валюта)
сумма_оплаты_надату(НомерДоговора, НаДату, ДатаИзменения, Сумма, Валюта) :- 
	%write('сумма_оплаты_надату #2 '), writeln(НаДату),
	текущий_договор(НомерДоговора),
	\+ уведомление_изменение_платы_надату(НомерДоговора, НаДату, _, _, _),!,
	арендная_плата(НомерДоговора, Сумма, Валюта, _, _, _),
	арендная_плата_первый_платёж(НомерДоговора, ДатаИзменения, _, _).

% Получить параметры текущего договора
атрибуты_договора(НомерДоговора, ТипДоговора, ДатаДоговора, Заказчик, Исполнитель) :-
	текущий_договор(НомерДоговора),
	договор(НомерДоговора, ТипДоговора, ДатаДоговора, Заказчик, Исполнитель).

% Данные об оплате в следующем месяце: НомерДоговора берётся из контекста
атрибуты_следующей_оплаты(НомерДоговора, ДатаОплаты, СуммаОплаты, Валюта) :-
	текущий_договор(НомерДоговора),
	today(Now), вдату(Now, Сегодня), %write(НомерДоговора), writeln(Сегодня),
	сумма_оплаты_надату(НомерДоговора, Сегодня, ДатаИзменения, СуммаОплаты, Валюта),
	ymd2date(ДатаИзменения, ChangeDate), date_time_stamp(ChangeDate, ChStamp), stamp_date_time(ChStamp, ChDate, local),
	date_time_stamp(Now, Stamp), stamp_date_time(Stamp, Date, local),
	date_time_value(year, Date, Y), date_time_value(month, Date, M), date_time_value(day, ChDate, D), %write(Y-M-D),
	(M =:= 12 -> (M1 = 1, Y1 is Y + 1); (M1 is M + 1, Y1 = Y)),
	ДатаОплаты = Y1-M1-D.

% Предикат main для проверки синтаксиса в SublimeText
main.
