% Веб-сервер

:- use_module(library(http/thread_httpd)).
:- use_module(library(http/http_dispatch)).

:- consult(subleaseexample).

:- http_handler(root(sublease_info), show_sublease_info, []).

server(Port) :-
        http_server(http_dispatch, [port(Port)]).

show_sublease_info(_Request) :-
        format('Content-type: text/plain~n~n'),
        задать_текущий_договор('01-18/САР'),
        get_sublease_info(НомерДоговора, ТипДоговора, ДатаДоговора, ТипСтороны1, КодЮрлица1,ТипСтороны2, КодЮрлица2),
        format('НомерДоговора: ~w~nТипДоговора: ~w~nДатаДоговора: ~w~n~w: ~w~n~w: ~w~n', [НомерДоговора, ТипДоговора, ДатаДоговора, ТипСтороны1, КодЮрлица1, ТипСтороны2, КодЮрлица2]),
        get_next_payment_info(НомерДоговора, ДатаОплаты, СуммаОплаты, Валюта),
        format('Дата оплаты: ~w~nСумма оплаты: ~w ~w~n', [ДатаОплаты, СуммаОплаты, Валюта]).

get_sublease_info(НомерДоговора, ТипДоговора, ДатаДоговора, ТипСтороны1, КодЮрлица1,ТипСтороны2, КодЮрлица2) :-
	атрибуты_договора(НомерДоговора, тип_договора(ТипДоговора), ДатаДоговора,
		сторона_договора(НомерДоговора, тип_стороны_договора(ТипСтороны1), КодЮрлица1),
		сторона_договора(НомерДоговора, тип_стороны_договора(ТипСтороны2), КодЮрлица2)).

get_next_payment_info(НомерДоговора, ДатаОплаты, СуммаОплаты, КодВалюты) :-
	атрибуты_следующей_оплаты(НомерДоговора, ДатаОплаты, СуммаОплаты, Валюта),
	код_валюты(Валюта, КодВалюты).
